package by.pev.unit6_Final;

public class Task4 {
    /*Задание 4(хотя бы 50%). Многопоточность. Порт . Корабли заходят в порт для разгрузки/загрузки контейнеров.
    Число контейнеров, находящихся в текущий момент в порту и на корабле, должно быть неотрицательным
    и превышающим заданную грузоподъемность судна и вместимость порта. В порту работает несколько причалов.
    У одного причала может стоять один корабль. Корабль может загружаться у причала или разгружаться.
    */
    public static void main(String[] args) {

    }
}
